[{"id":1,"title":"Parmesan Mushroom Risotto","slug":"parmesan-mushroom-risotto","thumbnail":{"url":"http://localhost:3001/uploads/risotto.jpg","slug":"risotto.jpg","file":{},"name":"risotto.jpg","set":true},"ingredients":["8 cups chicken broth, low sodium","3 tablespoons olive oil, divided","1 onion, diced, divided","2 garlic cloves, minced, divided","1 pound fresh portobello and crimini mushrooms, sliced","2 bay leaves","2 tablespoons fresh thyme, chopped","2 tablespoons fresh Italian parsley, chopped","2 tablespoons butter","Salt and pepper","1 tablespoon truffle oil","1-ounce dried porcini mushrooms, wiped of grit","2 cups Arborio rice","1/2 cup dry white wine","1/2 cup fresh Parmesan cheese, grated","Fresh Italian parsley, for garnish"],"servings":6,"time":{"prep":10,"cook":40,"total":50,"formatted":{"prep":"10 min","cook":"40 min","total":"50 min"}},"steps":["Heat the chicken broth in a medium saucepan and keep warm over low heat.","Heat 1 tablespoon of oil in a large skillet over medium heat. Add 1/2 onion and 1 clove garlic, cook, stirring, until translucent, about 5 minutes. Add the fresh mushrooms, herbs and butter. Saute for 3 to 5 minutes until lightly browned, season with salt and pepper. Drizzle in truffle oil then add the dried porcini mushrooms which were reconstituted in1 cup of warm chicken broth. Season again with salt and fresh cracked pepper. Saute 1 minute then remove from heat and set aside.","Coat a saucepan with remaining 2 tablespoons of oil. Saute the remaining 1/2 onion and garlic clove. Add the rice and stir quickly until it is well-coated and opaque, 1 minute. This step cooks the starchy coating and prevents the grains from sticking. Stir in wine and cook until it is nearly all evaporated.","Now, with a ladle, add 1 cup of the warm broth and cook, stirring, until the rice has absorbed the liquid. Add the remaining broth, 1 cup at a time. Continue to cook and stir, allowing the rice to absorb each addition of broth before adding more. The risotto should be slightly firm and creamy, not mushy. Transfer the mushrooms to the rice mixture. Stir in Parmesan cheese, cook briefly until melted. Top with a drizzle of truffle oil and chopped parsley before serving."],"date":{"created":1525498457299,"edited":0},"_deleted":false},{"id":2,"title":"Breakfast Sandwich","slug":"breakfast-sandwich","thumbnail":{"url":"http://localhost:3001/uploads/sandwich.jpg","slug":"sandwich.jpg","file":{},"name":"sandwich.jpg","set":true},"ingredients":["1 clove garlic, minced","1/4 cup mayonnaise","4 3/4-inch thick slices of crusty bread","2 cups arugula","2 teaspoons olive oil","1/2 teaspoon fresh lemon juice","1 pinch salt","1 pinch freshly ground black pepper","Cooking spray","4 eggs"],"servings":4,"time":{"prep":15,"cook":5,"total":20,"formatted":{"prep":"15 min","cook":"5 min","total":"20 min"}},"steps":["Mix garlic and mayonnaise together in a small bowl. Spread mayonnaise on 1 side of the bread slices. Mix arugula with olive oil, lemon juice, salt, and black pepper in a bowl until coated; divide arugula in fourths, placing each portion atop mayonnaise side of a bread slice.","Spray a skillet with cooking spray, place over medium-high heat, and crack eggs into skillet, one at a time. Cook on one side only until whites are firm and yolks are slightly runny, 2 to 3 minutes. Season eggs with salt and black pepper. Gently place an egg on each open-face sandwich."],"date":{"created":1525498632025,"edited":0},"_deleted":false},{"id":3,"title":"Strawberry Shortcake","slug":"strawberry-shortcake","thumbnail":{"url":"http://localhost:3001/uploads/shortcake.jpg","slug":"shortcake.jpg","file":{},"name":"shortcake.jpg","set":true},"ingredients":["1 1/2 pounds strawberries, stemmed and quartered","5 tablespoons sugar","2 cups all-purpose flour","2 teaspoons baking powder","1/4 teaspoon baking soda","2 tablespoons sugar","3/4 teaspoon salt","1 1/2 cups heavy cream","Whipped Cream:","1 1/2 cups heavy cream, chilled","3 tablespoons sugar","1 1/2 teaspoons vanilla extract","1 teaspoon freshly grated lemon zest"],"servings":6,"time":{"prep":50,"cook":20,"total":70,"formatted":{"prep":"50 min","cook":"20 min","total":"1 hr 10 min"}},"steps":["Mix strawberries with 3 tablespoons sugar and refrigerate while juices develop, at least 30 minutes.","Preheat the oven to 400 degrees F.","Sift together the flour, baking powder, baking soda, remaining 2 tablespoons sugar, and salt in a medium bowl. Add heavy cream and mix until just combined. Place mixture in an ungreased 8-inch square pan and bake until golden, 18 to 20 minutes.","Remove shortcake from pan and place on a rack to cool slightly. Cut into 6 pieces and split each piece in half horizontally.","Spoon some of the strawberries with their juice onto each shortcake bottom. Top with a generous dollop of whipped cream and then the shortcake top. Spoon more strawberries over the top and serve.","Whipped Cream: Using a mixer, beat the heavy cream, sugar, vanilla, and lemon zest until soft peaks form, about 1 1/2 to 2 minutes."],"date":{"created":1525500462496,"edited":0},"_deleted":false},{"id":4,"title":"Chinese Pork Dumplings","slug":"chinese-pork-dumplings","thumbnail":{"url":"http://localhost:3001/uploads/dumplings.jpg","slug":"dumplings.jpg","file":{},"name":"dumplings.jpg","set":true},"ingredients":["1/2 cup soy sauce","1 tablespoon seasoned rice vinegar","1 tablespoon finely chopped Chinese chives","1 tablespoon sesame seeds","1 teaspoon chile-garlic sauce (such as Sriracha®)","1 pound ground pork","3 cloves garlic, minced","1 egg, beaten","2 tablespoons finely chopped Chinese chives","2 tablespoons soy sauce","1 1/2 tablespoons sesame oil","1 tablespoon minced fresh ginger","50 dumpling wrappers","1 cup vegetable oil for frying","1 quart water, or more as needed"],"servings":5,"time":{"prep":20,"cook":60,"total":80,"formatted":{"prep":"20 min","cook":"1 hr","total":"1 hr 20 min"}},"steps":["Combine 1/2 cup soy sauce, rice vinegar, 1 tablespoon chives, sesame seeds, and chile sauce in a small bowl. Set aside.","Mix pork, garlic, egg, 2 tablespoons chives, soy sauce, sesame oil, and ginger in a large bowl until thoroughly combined. Place a dumpling wrapper on a lightly floured work surface and spoon about 1 tablespoon of the filling in the middle. Wet the edge with a little water and crimp together forming small pleats to seal the dumpling. Repeat with remaining dumpling wrappers and filling.","Heat 1 to 2 tablespoons vegetable oil in a large skillet over medium-high heat. Place 8 to 10 dumplings in the pan and cook until browned, about 2 minutes per side. Pour in 1 cup of water, cover and cook until the dumplings are tender and the pork is cooked through, about 5 minutes. Repeat for remaining dumplings. Serve with soy sauce mixture for dipping."],"date":{"created":1525500500514,"edited":0},"_deleted":false}]